pages/giss/giss-yearly-anomalies-by-climate-zone/index.html
<!DOCTYPE html>
<html lang="en" prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article#">
<head>
<meta charset="utf-8">
<meta content="GISS yearly anomalies by climate zone." name="description">
<meta content="width=device-width, initial-scale=1" name="viewport">
<title>GISS Yearly Anomalies By Climate Zone | Visions, Voices, Data</title>
<link href="../../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<link href="../../../assets/css/ipython.min.css" rel="stylesheet" type="text/css">
<link href="../../../assets/css/nikola_ipython.css" rel="stylesheet" type="text/css">
<meta content="#5670d4" name="theme-color">
<meta content="Nikola (getnikola.com)" name="generator">
<link href="../../../rss.xml" hreflang="en" rel="alternate" title="RSS" type="application/rss+xml">
<link href="https://necromuralist.github.io/Visions-Voices-Data/pages/giss/giss-yearly-anomalies-by-climate-zone/" rel="canonical"><!--[if lt IE 9]><![endif]-->
<!--
<meta content="Cloistered Monkey" name="author">
<meta content="Visions, Voices, Data" property="og:site_name">
<meta content="GISS Yearly Anomalies By Climate Zone" property="og:title">
<meta content="https://necromuralist.github.io/Visions-Voices-Data/pages/giss/giss-yearly-anomalies-by-climate-zone/" property="og:url">
<meta content="GISS yearly anomalies by climate zone." property="og:description">
<meta content="article" property="og:type">
<meta content="2019-03-19T20:38:39-07:00" property="article:published_time">
<meta content="giss" property="article:tag">
</head>
<body>
<a class="sr-only sr-only-focusable" href="#content">Skip to main content</a> <!-- Menubar -->
<nav class="navbar navbar-expand-md static-top mb-4 navbar-light bg-light">
<div class="container"><!-- This keeps the margins nice -->
 <a class="navbar-brand" href="/"><span id="blog-title">Visions, Voices, Data</span></a> <button aria-controls="bs-navbar" aria-expanded="false" aria-label="Toggle navigation" class="navbar-toggler" data-target="#bs-navbar" data-toggle="collapse" type="button"><span class="navbar-toggler-icon"></span></button>
<div class="collapse navbar-collapse" id="bs-navbar">
<ul class="navbar-nav mr-auto">
<li class="nav-item"><a class="nav-link" href="/archive.html">Archive</a></li>
<li class="nav-item"><a class="nav-link" href="/categories/">Tags</a></li>
<li class="nav-item"><a class="nav-link" href="/rss.xml">RSS feed</a></li>
<li class="nav-item dropdown"><a aria-expanded="false" aria-haspopup="true" class="nav-link dropdown-toggle" data-toggle="dropdown" href="#">Pages</a>
<div class="dropdown-menu"><a class="dropdown-item" href="https://necromuralist.github.io/">Cloistered Monkey</a> <a class="dropdown-item" href="/pages/giss/giss-yearly-anomalies-by-climate-zone">GISS Anomalies</a></div>
</li>
</ul>
<!-- DuckDuckGo custom search -->
<form action="https://duckduckgo.com/" class="navbar-form pull-left" id="search" method="get" name="search"><input name="sites" type="hidden" value="https://necromuralist.github.io/Visions-Voices-Data/"> <input name="k8" type="hidden" value="#444444"> <input name="k9" type="hidden" value="#D51920"> <input name="kt" type="hidden" value="h"> <input class="span2" maxlength="255" name="q" placeholder="Search…" type="text"> <input style="visibility: hidden;display:none" type="submit" value="DuckDuckGo Search"></form>
<!-- End of custom search -->
<ul class="navbar-nav navbar-right">
<li class="nav-item"><a class="nav-link" href="/pages/giss/giss-yearly-anomalies-by-climate-zone/index.org" id="sourcelink">Source</a></li>
</ul>
</div>
<!-- /.navbar-collapse --></div>
<!-- /.container --></nav>
<!-- End of Menubar -->
<div class="container" id="content" role="main">
<div class="body-content"><!--Body content-->
<article class="post-text storypage" itemscope="itemscope" itemtype="http://schema.org/Article">
<header>
<h1 class="p-name entry-title" itemprop="headline name"><a class="u-url" href="/pages/giss/giss-yearly-anomalies-by-climate-zone/">GISS Yearly Anomalies By Climate Zone</a></h1>
</header>
<div class="e-content entry-content" itemprop="articleBody text">
<div class="outline-2" id="outline-container-orgd8a377d">
<h2 id="orgd8a377d">Introduction</h2>
<div class="outline-text-2" id="text-orgd8a377d">
<p>This is a look at the <a href="https://data.giss.nasa.gov/gistemp/">Godard Institute for Space Studies' surface temperature data</a>. The data values are differences between the mean temperature in a given year for a given region from <i>normal</i> (<i>normal</i> being the mean of the temperatures measured from 1951 through 1980).</p>
<script id="0db6bf93-f2ed-47a5-b6ad-1fb2f0dcf363" src="/pages/giss/giss-yearly-anomalies-by-climate-zone/tabbed_plots.js"></script>
<p>There are three plots accessible by the tabs:</p>
<ul class="org-ul">
<li><i>Hemispheres</i> : Northern and Southern Hemispheres and Global mean. Shows the overall upward trend.</li>
<li><i>Tropics vs Extra-Tropics</i>: Tropical mean and non-tropical means. Similar to <i>Hemispheres</i> but compares equatorial vs non-equatorial regions.</li>
<li><i>Climate Zones</i>: Temperatures grouped by eight climate zones. Makes clearer the exagerated effect on northern- and southern-most regions.</li>
</ul>
<p>Clicking on items in the legend will de-emphasize them.</p>
<!--End of body content-->
<footer id="footer">Contents © 2020 <a href="mailto:necromuralist@protonmail.com">Cloistered Monkey</a> - Powered by <a href="https://getnikola.com" rel="nofollow">Nikola</a></footer>
<script src="../../../assets/js/all-nocdn.js"></script>
<script>

    baguetteBox.run('div#content', {
        ignoreClass: 'islink',
        captions: function(element) {
            return element.getElementsByTagName('img')[0].alt;
    }});
</script> </div>
</div>
</div>
</article>
</div>
</div>
</body>
</html>
